In [42]:
<b><h1>DARSHAN UNIVERSITY</b>
<br>
<center><b><h1> JAY PATEL</b></center>
<center><b><h1>23010101201</b></center> 
<center><b><h1>418</b></center>

SyntaxError: invalid syntax (1112511990.py, line 1)

# Online Retail Dataset Analysis

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("OnlineRetail.csv", encoding="ISO-8859-1")

## 1. Shape of the dataset

In [3]:
df.shape

(541909, 8)

## 2. Column names

In [11]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

## 3. Data types

In [12]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

## 4. Info summary

In [13]:
df.info

<bound method DataFrame.info of        InvoiceNo StockCode                          Description  Quantity  \
0         536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER         6
1         536365     71053                  WHITE METAL LANTERN         6
2         536365    84406B       CREAM CUPID HEARTS COAT HANGER         8
3         536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6
4         536365    84029E       RED WOOLLY HOTTIE WHITE HEART.         6
...          ...       ...                                  ...       ...
541904    581587     22613          PACK OF 20 SPACEBOY NAPKINS        12
541905    581587     22899         CHILDREN'S APRON DOLLY GIRL          6
541906    581587     23254        CHILDRENS CUTLERY DOLLY GIRL          4
541907    581587     23255      CHILDRENS CUTLERY CIRCUS PARADE         4
541908    581587     22138        BAKING SET 9 PIECE RETROSPOT          3

            InvoiceDate  UnitPrice  CustomerID         Country
0        12/1/2010 8:26       2.55     17850.0  United Kingdom
1        12/1/2010 8:26       3.39     17850.0  United Kingdom
2        12/1/2010 8:26       2.75     17850.0  United Kingdom
3        12/1/2010 8:26       3.39     17850.0  United Kingdom
4        12/1/2010 8:26       3.39     17850.0  United Kingdom
...                 ...        ...         ...             ...
541904  12/9/2011 12:50       0.85     12680.0          France
541905  12/9/2011 12:50       2.10     12680.0          France
541906  12/9/2011 12:50       4.15     12680.0          France
541907  12/9/2011 12:50       4.15     12680.0          France
541908  12/9/2011 12:50       4.95     12680.0          France

[541909 rows x 8 columns]>

## 5. Statistical description

In [14]:
df.describe(include="all")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
count,541909,541909,540455,541909.000000,541909,541909.000000,406829.000000,541909
unique,25900,4070,4223,NaN,23260,NaN,NaN,38
top,573585,85123A,WHITE HANGING HEART T-LIGHT HOLDER,NaN,10/31/2011 14:41,NaN,NaN,United Kingdom
freq,1114,2313,2369,NaN,1114,NaN,NaN,495478
mean,NaN,NaN,NaN,9.552250,NaN,4.611114,15287.690570,NaN
std,NaN,NaN,NaN,218.081158,NaN,96.759853,1713.600303,NaN
min,NaN,NaN,NaN,-80995.000000,NaN,-11062.060000,12346.000000,NaN
25%,NaN,NaN,NaN,1.000000,NaN,1.250000,13953.000000,NaN
50%,NaN,NaN,NaN,3.000000,NaN,2.080000,15152.000000,NaN
75%,NaN,NaN,NaN,10.000000,NaN,4.130000,16791.000000,NaN
max,NaN,NaN,NaN,80995.000000,NaN,38970.000000,18287.000000,NaN

## 6. Null values count

In [15]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

## 7. Unique values per column

In [16]:
print(df.nunique())

InvoiceNo      25900
StockCode       4070
Description     4223
Quantity         722
InvoiceDate    23260
UnitPrice       1630
CustomerID      4372
Country           38
dtype: int64

## 8. First 5 rows

In [17]:
df.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

## 9. Last 5 rows

In [18]:
df.tail(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

## 10. Sample random rows

In [24]:
df.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
530583,580875,21563,RED HEART SHAPE LOVE BUCKET,24,12/6/2011 12:11,0.79,17744.0,United Kingdom
412377,572286,21823,PAINTED METAL HEART WITH HOLLY BELL,24,10/23/2011 12:18,0.39,16434.0,United Kingdom
284136,561860,22403,MAGNETS PACK OF 4 VINTAGE LABELS,12,7/29/2011 17:28,0.39,17997.0,United Kingdom
523632,580516,21284,RETROSPOT CANDLE SMALL,12,12/4/2011 14:15,0.39,17954.0,United Kingdom
404988,571705,22139,RETROSPOT TEA SET CERAMIC 11 PC,6,10/18/2011 15:22,4.95,12360.0,Austria

## 11. Duplicate rows

In [25]:
df.duplicated().sum()

5268

## 12. Negative Quantity

In [15]:
df[df['Quantity'] < 0].shape[0]

10624

## 13. Zero UnitPrice

In [26]:
df[df['UnitPrice'] == 0].shape[0]

2515

## 14. Top 5 countries by transaction

In [29]:
df['Country'].value_counts().head()

Country
United Kingdom    495478
Germany             9495
France              8557
EIRE                8196
Spain               2533
Name: count, dtype: int64

## 15. Top 5 most sold products

In [17]:
df['Description'].value_counts().head()

Description
WHITE HANGING HEART T-LIGHT HOLDER    2369
REGENCY CAKESTAND 3 TIER              2200
JUMBO BAG RED RETROSPOT               2159
PARTY BUNTING                         1727
LUNCH BAG RED RETROSPOT               1638
Name: count, dtype: int64

## 16. Convert InvoiceDate to datetime

In [27]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

## 17. Invoice date range

In [28]:
print("Date Range:", df['InvoiceDate'].min(), "to", df['InvoiceDate'].max())

Date Range: 2010-12-01 08:26:00 to 2011-12-09 12:50:00

## 18. Unique invoices

In [29]:
df["InvoiceNo"].nunique()

25900

## 19. Add revenue column and total revenue

In [30]:
df['Revenue'] = df['Quantity'] * df['UnitPrice']
total_revenue = df[df['Quantity'] > 0]['Revenue'].sum()
print("Total Revenue (excl. returns):", total_revenue)

Total Revenue (excl. returns): 10644560.424

## 20. Monthly transactions

In [26]:
# Task 20: Monthly transactions

## 21. Top customers by revenue

In [33]:
df.groupby("CustomerID")["Revenue"].sum().sort_values(ascending=False).head()

CustomerID
14646.0    279489.02
18102.0    256438.49
17450.0    187482.17
14911.0    132572.62
12415.0    123725.45
Name: Revenue, dtype: float64

## 22. Top countries by revenue

In [34]:
df.groupby("Country")["Revenue"].sum().sort_values(ascending=False).head()

Country
United Kingdom    8187806.364
Netherlands        284661.540
EIRE               263276.820
Germany            221698.210
France             197403.900
Name: Revenue, dtype: float64

## 23. Most common product per country

In [35]:
df.groupby("Country")["Description"].agg(lambda x: x.value_counts().idxmax()).head()

Country
Australia     SET OF 3 CAKE TINS PANTRY DESIGN
Austria                                 POSTAGE
Bahrain      OCEAN SCENT CANDLE IN JEWELLED BOX
Belgium                                 POSTAGE
Brazil                 REGENCY CAKESTAND 3 TIER
Name: Description, dtype: object

## 24. Average order value

In [36]:
df.groupby("InvoiceNo")["Revenue"].sum().mean()

376.3609240926641

## 25. Distinct products sold

In [37]:
df["Description"].nunique()

4223

## 26. Orders with more than 10 items

In [38]:
df[df["Quantity"] > 10]["InvoiceNo"].nunique()

17165

## 27. Orders from UK

In [39]:
df[df["Country"] == 'United Kingdom']["InvoiceNo"].nunique()

23494

## 28. Most expensive item sold

In [40]:
df["UnitPrice"].max()

38970.0

## 29. Correlation between Quantity and UnitPrice

In [40]:
df[["Quantity", "UnitPrice"]].corr()

           Quantity  UnitPrice
Quantity   1.000000  -0.001235
UnitPrice -0.001235   1.000000

In [41]:
df[["Quantity", "UnitPrice"]].cov()

               Quantity    UnitPrice
Quantity   47559.391409   -26.058761
UnitPrice    -26.058761  9362.469164

## 30. Daily revenue trend (sample)